---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteAlignedCorruption
source: html/e65482fa-ea85-8c0a-1439-3be811a95411.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteAlignedCorruption Property

Can't Paste Aligned these elements in this view.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPasteAlignedCorruption { get; }
```